[
  {
    "ministry_name": "Advanced Education",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/advanced-education",
    "description": "Advanced Education is the ministry responsible for developing a skilled and educated workforce to meet Saskatchewan’s labour market needs. Find information and services related to Saskatchewan’s post-secondary institutions and financial programs, like student aid or the Graduate Retention Program."
  },
  {
    "ministry_name": "Agriculture",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/agriculture",
    "description": "The Ministry of Agriculture is responsible for services to Saskatchewan’s farmers, ranchers and Agribusiness. Find out more about research and biotechnology, crop and livestock production and the Sustainable Canadian Agricultural Partnership, designed in consultation with producers, industry and other stakeholders."
  },
  {
    "ministry_name": "Corrections, Policing and Public Safety",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/corrections-policing-and-public-safety",
    "description": "The Ministry of Corrections, Policing and Public Safety is responsible for overseeing Saskatchewan’s correctional system and facilities, providing guidance and support to Saskatchewan’s municipal police services."
  },
  {
    "ministry_name": "Crown Investments Corporation",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/crown-investments-corporation",
    "description": "Crown Investments Corporation (CIC) is the holding company for the province’s commercial Crown corporations."
  },
  {
    "ministry_name": "Education",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/education",
    "description": "The Ministry of Education puts the needs of K-12 students first. It is committed to learning success and literacy. Learn more about early learning and child care, Kindergarten through Grade 12 education and the provincial network of libraries."
  },
  {
    "ministry_name": "Energy and Resources",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/energy-and-resources",
    "description": "The Ministry of Energy and Resources develops, co-ordinates and implements policies and programs to promote the growth and responsible development of the province’s natural resources industries. The ministry operates as the primary regulatory authority for the oil and gas industry and ensures competitive royalty systems, regulations and policies for all natural resource sectors."
  },
  {
    "ministry_name": "Environment",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/environment",
    "description": "The Ministry of Environment manages Saskatchewan’s diverse landscapes and renewable natural resources. Information and services include environmental protection and sustainable management of wildlife, fish, forests and Crown lands."
  },
  {
    "ministry_name": "Executive Council and Office of the Premier",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/executive-council-and-office-of-the-premier",
    "description": "Executive Council is a central organization in government that provides support to the Premier and Cabinet. It creates the plan for Saskatchewan and manages how it is implemented across government."
  },
  {
    "ministry_name": "Finance",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/finance",
    "description": "The Ministry of Finance is responsible for the provincial budget and manages the government’s banking, investment and public debt functions. Learn more about provincial taxes, tax policy, economic forecasting and other economic and social statistics."
  },
  {
    "ministry_name": "Government Relations",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/government-relations",
    "description": "The Ministry of Government Relations provides programs and services related to Saskatchewan’s municipal and First Nations governments, as well as First Nations, Métis and northern affairs."
  },
  {
    "ministry_name": "Health",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/health",
    "description": "The Ministry of Health is focused on putting patients' needs first. Information and services available through this ministry include: health card applications and changes, information on surgical wait times, emergency medical services, prescription drug plans, flu information and services for people with disabilities  or long-term illnesses."
  },
  {
    "ministry_name": "Highways",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/highways",
    "description": "The ministry manages Saskatchewan’s highways to ensure the safe and efficient movement of people and goods; and the Highway Hotline, which provides information on highway construction, road closures and road conditions."
  },
  {
    "ministry_name": "Immigration and Career Training",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/immigration-and-career-training",
    "description": "The Ministry of Immigration and Career Training leads efforts to help individuals prepare for, obtain and maintain employment, and activities to assist employers with the development, recruitment and retention of workers."
  },
  {
    "ministry_name": "Justice and Attorney General",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/justice",
    "description": "The Ministry of Justice and Attorney General is responsible for Saskatchewan’s justice system. Key information or services available include: child support, commissioner for oaths or notary public, landlords and tenants, marriage commissioners and licences, and licensing for private investigators or security guards."
  },
  {
    "ministry_name": "Labour Relations and Workplace Safety",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/labour-relations-and-workplace-safety",
    "description": "Government encourages healthy, safe and productive workplaces through employment and occupational health and safety standards through the Ministry of Labour Relations and Workplace Safety. This ministry works with employers and employees, as well as industry stakeholders, to reduce and eliminate workplace injuries and create a positive work environment."
  },
  {
    "ministry_name": "Parks, Culture and Sport",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/parks-culture-and-sport",
    "description": "The Ministry of Parks, Culture and Sport is responsible for Saskatchewan’s provincial parks, preservation of heritage and culture and participation in sport. Visit our provincial parks or the Royal Saskatchewan Museum. Learn about why Saskatchewan is the best place to live, work and play by following the Saskatchewanderer."
  },
  {
    "ministry_name": "SaskBuilds and Procurement",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/saskbuilds-and-procurement",
    "description": "The Ministry of SaskBuilds and Procurement provides services related to central property management services including government buildings, accommodations, transportation and information technology."
  },
  {
    "ministry_name": "Social Services",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/social-services",
    "description": "The Ministry of Social Services provides information and programming in areas such as income support, child and family services, affordable housing and supports for persons with disabilities. Key programs and services include child care subsidies, adoption services, child protection, foster care, financial assistance and housing programs."
  },
  {
    "ministry_name": "Trade and Export Development",
    "ministry_url": "https://www.saskatchewan.ca/government/government-structure/ministries/trade-and-export-development",
    "description": "The Ministry of Trade and Export Development advances economic growth to generate wealth and opportunity in Saskatchewan. The ministry facilitates a co-ordinated cross-government approach to attract investment and grow export markets. The ministry fosters and supports a competitive business environment, facilitates trade and strengthens Saskatchewan’s international relations."
  }
]